{
  "examples": [
    {
      "question": "Какие магазины имеют наибольшую выручку в категории 'Молочные продукты'?",
      "explanation": "Итак, что мы хотим узнать? Нам нужны магазины с наибольшей выручкой от молочных продуктов.\nДля этого:\nНазвание магазина берем из таблицы \"Информация о магазинах\" (stores) из поля \"Название магазина\" (store_name), это даст нам понятное имя каждой торговой точки\nФормат магазина тоже берем из таблицы \"Информация о магазинах\" (stores) из поля \"Формат\" (format), чтобы понять, какой это тип магазина: гипермаркет, супермаркет или что-то еще\nГород расположения магазина берем из той же таблицы \"Информация о магазинах\" (stores) из поля \"Город\" (city), чтобы видеть географию продаж\nДля вычисления выручки берем сумму значений из таблицы \"Данные о продажах\" (sales) из поля \"Сумма продажи\" (total_amount), округляя до двух знаков после запятой для удобства чтения\nНо подождите, в таблице \"Данные о продажах\" (sales) у нас только идентификаторы продуктов и магазинов, а нам нужно отфильтровать только молочные продукты. Значит:\n\nСначала соединяем таблицу \"Данные о продажах\" (sales) с таблицей \"Информация о товарах\" (products) по полю \"ИД товара\" (product_id), чтобы узнать, к какой категории относится каждый проданный товар\nЗатем соединяем результат с таблицей \"Категории товаров\" (categories) по полю \"ИД категории\" (category_id), чтобы получить название категории\nТакже соединяем с таблицей \"Информация о магазинах\" (stores) по полю \"ИД магазина\" (store_id), чтобы получить информацию о магазинах\nПосле этого мы можем отфильтровать только те продажи, где категория товара - 'Молочные продукты'.\n\nГруппируем результаты по названию магазина, формату и городу, чтобы суммировать выручку для каждого магазина.\n\nИ наконец, сортируем магазины по выручке в порядке убывания, чтобы сразу видеть самые успешные магазины по продаже молочных продуктов."
    },
    {
      "question": "Покажи топ-10 товаров по продажам за последний месяц",
      "explanation": "Что нам нужно найти? Мы хотим увидеть 10 товаров, которые лучше всего продавались в течение последнего месяца.\n\nДля этого нам потребуется:\n1. Название товара - берем из таблицы \"Информация о товарах\" (products) из поля \"Наименование товара\" (product_name), чтобы видеть понятные названия продуктов\n2. Количество проданных единиц - суммируем значения из таблицы \"Данные о продажах\" (sales) из поля \"Количество\" (quantity), чтобы узнать общее количество единиц продукта, проданных за месяц\n3. Общая выручка от продаж - суммируем значения из таблицы \"Данные о продажах\" (sales) из поля \"Сумма продажи\" (total_amount), чтобы понять финансовый объем продаж по каждому товару\n\nНо у нас в таблице продаж только идентификаторы товаров, поэтому:\n1. Соединяем таблицу \"Данные о продажах\" (sales) с таблицей \"Информация о товарах\" (products) по полю \"ИД товара\" (product_id), чтобы связать продажи с информацией о товарах\n\nТакже нам нужно отфильтровать данные только за последний месяц:\n1. Добавляем условие на поле \"Дата продажи\" (sale_date), чтобы выбрать только продажи, совершенные в течение последнего месяца\n\nЗатем группируем результаты по названию товара, чтобы объединить все продажи одного товара в одну строку.\n\nСортируем результаты по общему количеству проданных единиц в порядке убывания, чтобы самые популярные товары были сверху.\n\nИ наконец, ограничиваем вывод только 10 первыми строками, чтобы получить топ-10."
    }
  ]
} 